<?php
session_start();
session_regenerate_id(TRUE);
require 'php/libs/functions.php';

$name = $_SESSION['name'] ?? NULL;
$email = $_SESSION['email'] ?? NULL;
$message = $_SESSION['message'] ?? NULL;
$error = $_SESSION['error'] ?? NULL;

$error_name = $error['name'] ?? NULL;
$error_email = $error['email'] ?? NULL;
$error_message = $error['message'] ?? NULL;

$_SESSION = array();

if (!isset($_SESSION['ticket'])) {
    $_SESSION['ticket'] = bin2hex(random_bytes(32));
}
$ticket = $_SESSION['ticket'];

?>
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Ururunya's Portfolio</title>
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Noto+Sans+JP:wght@400;700&family=Roboto:wght@400;700&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="styles/vendors/bootstrap-reboot.css">
    <link rel="stylesheet" href="styles/style.css">
</head>

<body>
    <div id="global-container">
        <div id="container">
            <header class="header">
                <div class="header__inner">
                    <div class="logo">
                        <a href="/" class="logo__link">
                            <img src="images/tech_logo 1.svg" alt="" class="logo__img" />
                        </a>
                    </div>
                    <nav class="header__nav">
                        <ul class="header__ul">
                            <li class="header__li">
                                <a href="#about" data-target="about"><span>About</span><span>私について</span></a>
                            </li>
                            <li class="header__li">
                                <a href="#skills" data-target="skills"><span>Skills</span><span>使用スキル</span></a>
                            </li>
                            <li class="header__li">
                                <a href="#portfolio" data-target="portfolio"><span>Portfolio</span><span>制作例</span></a>
                            </li>
                            <li class="header__li">
                                <a class="btn" href="#contact" data-target="contact"><span>Contact</span><span>問合せ</span></a>
                            </li>
                        </ul>
                    </nav>
                    <button class="mobile-menu__btn">
                        <span></span>
                        <span></span>
                        <span></span>
                    </button>
                </div>
            </header>
            <div id="content">
                <div class="hero">
                    <div class="hero-inner">
                        <div class="hero__heading">
                            <h2>Ururunya’s <span>Portfolio</span></h2>
                            <p>Front-end Developer / Back-end Developer</p>
                        </div>
                        <div class="hero__link">
                            <ul>
                                <li class="hero__btn">
                                    <a href="#" class="twitter">
                                        <svg width="64" height="64" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g filter="url(#filter0_d_22_18)">
                                                <circle cx="28" cy="28" r="28" fill="#C4C4C4" />
                                            </g>
                                            <path d="M45 19.0333C43.7996 19.5549 42.5296 19.8985 41.23 20.0533C42.5958 19.2536 43.6229 17.9831 44.1187 16.48C42.8274 17.2351 41.417 17.7649 39.948 18.0467C39.3294 17.3984 38.5854 16.8826 37.7613 16.5308C36.9372 16.1789 36.0501 15.9984 35.154 16C31.526 16 28.59 18.8933 28.59 22.46C28.5874 22.9561 28.6443 23.4508 28.7593 23.9333C26.1578 23.8114 23.6104 23.1477 21.28 21.9848C18.9496 20.822 16.8877 19.1855 15.226 17.18C14.643 18.1628 14.3348 19.284 14.3333 20.4267C14.3333 22.6667 15.502 24.6467 17.2667 25.8067C16.2212 25.7819 15.1971 25.5051 14.2813 25V25.08C14.2813 28.2133 16.548 30.82 19.548 31.4133C18.9839 31.5637 18.4025 31.6399 17.8187 31.64C17.4044 31.6407 16.991 31.6005 16.5847 31.52C17.4187 34.0867 19.846 35.9533 22.7213 36.0067C20.3849 37.8073 17.5164 38.7805 14.5667 38.7733C14.0431 38.7726 13.52 38.7414 13 38.68C16.0008 40.5962 19.489 41.6097 23.0493 41.6C35.14 41.6 41.7453 31.7533 41.7453 23.2133C41.7453 22.9333 41.738 22.6533 41.7247 22.38C43.0067 21.4681 44.1159 20.3348 45 19.0333Z" fill="black" />
                                            <defs>
                                                <filter id="filter0_d_22_18" x="0" y="0" width="64" height="64" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                                    <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                                    <feOffset dx="4" dy="4" />
                                                    <feGaussianBlur stdDeviation="2" />
                                                    <feComposite in2="hardAlpha" operator="out" />
                                                    <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0" />
                                                    <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_22_18" />
                                                    <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_22_18" result="shape" />
                                                </filter>
                                            </defs>
                                        </svg>
                                    </a>
                                </li>
                                <li class="hero__btn">
                                    <a href="https://github.com/ururunya" class="github">
                                        <svg width="64" height="64" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g filter="url(#filter0_d_22_17)">
                                                <circle cx="28" cy="28" r="28" fill="#C4C4C4" />
                                            </g>
                                            <path d="M28 12C19.1643 12 12 19.35 12 28.4071C12 35.6571 16.5857 41.8 22.9429 43.9714C23.032 43.9908 23.123 44.0004 23.2143 44C23.8071 44 24.0357 43.5643 24.0357 43.1857C24.0357 42.7929 24.0214 41.7643 24.0143 40.3929C23.485 40.5169 22.9436 40.5816 22.4 40.5857C19.3214 40.5857 18.6214 38.1929 18.6214 38.1929C17.8929 36.3 16.8429 35.7929 16.8429 35.7929C15.45 34.8143 16.8357 34.7857 16.9429 34.7857H16.95C18.5571 34.9286 19.4 36.4857 19.4 36.4857C20.2 37.8857 21.2714 38.2786 22.2286 38.2786C22.8615 38.2659 23.4845 38.1199 24.0571 37.85C24.2 36.7929 24.6143 36.0714 25.0714 35.6571C21.5214 35.2429 17.7857 33.8357 17.7857 27.55C17.7857 25.7571 18.4071 24.2929 19.4286 23.15C19.2643 22.7357 18.7143 21.0643 19.5857 18.8071C19.7026 18.7792 19.8227 18.7672 19.9429 18.7714C20.5214 18.7714 21.8286 18.9929 23.9857 20.4929C26.6068 19.7595 29.3789 19.7595 32 20.4929C34.1571 18.9929 35.4643 18.7714 36.0429 18.7714C36.163 18.7672 36.2831 18.7792 36.4 18.8071C37.2714 21.0643 36.7214 22.7357 36.5571 23.15C37.5786 24.3 38.2 25.7643 38.2 27.55C38.2 33.85 34.4571 35.2357 30.8929 35.6429C31.4643 36.15 31.9786 37.15 31.9786 38.6786C31.9786 40.8714 31.9571 42.6429 31.9571 43.1786C31.9571 43.5643 32.1786 44 32.7714 44C32.8674 44.0004 32.9632 43.9908 33.0571 43.9714C39.4214 41.8 44 35.65 44 28.4071C44 19.35 36.8357 12 28 12Z" fill="black" />
                                            <defs>
                                                <filter id="filter0_d_22_17" x="0" y="0" width="64" height="64" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                                    <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                                    <feOffset dx="4" dy="4" />
                                                    <feGaussianBlur stdDeviation="2" />
                                                    <feComposite in2="hardAlpha" operator="out" />
                                                    <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0" />
                                                    <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_22_17" />
                                                    <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_22_17" result="shape" />
                                                </filter>
                                            </defs>
                                        </svg>

                                    </a>
                                </li>
                            </ul>
                        </div>
                    </div>
                    <div class="intro">
                        <div class="intro__logos">
                            <ul>
                                <li class="intro__logo">
                                    <svg width="416" height="254" viewBox="0 0 416 254" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M404.803 79.712C401.886 77.3318 380.588 57.5984 369.106 46.9636C363 41.3105 358.178 36.8439 356.155 34.9945L355.992 34.8436L355.815 34.7025C351.15 30.7503 344.693 26.3762 336.072 27.57C334.673 27.7821 333.29 28.0896 331.932 28.4903C331.651 28.5686 331.364 28.6558 331.059 28.7296C329.192 29.2011 323.434 30.9684 309.762 35.2121C299.174 38.4845 283.211 43.4398 280.767 44.0149L280.224 44.1374L279.704 44.312C272.156 46.7611 267.509 50.9064 265.981 56.6153C265.175 59.6291 264.684 65.5888 270.384 71.6689C271.806 73.2229 276.694 78.335 285.095 87.117C290.685 92.968 296.964 99.5279 302.391 105.228L219.018 137.288L115.305 10.5134L115.113 10.2717L114.9 10.041L114.49 9.58513C110.328 4.98768 105.15 -0.738857 92.7215 0.982228C91.847 1.10333 90.9339 1.22978 89.9242 1.45636C86.3913 2.14279 73.5165 4.96681 58.6146 8.24506C42.1656 11.8559 19.6542 16.7952 16.7088 17.282L16.1438 17.3602L15.5411 17.5068C8.56343 19.175 3.83037 22.7565 1.47499 28.1303C-2.44815 37.1048 2.80771 45.8412 4.53002 48.7102C7.99202 54.5166 38.6752 101.296 65.7437 142.59C83.7389 170.021 102.321 198.388 103.87 200.918C106.636 205.662 110.771 209.459 115.733 211.811C120.695 214.163 126.252 214.959 131.675 214.095C134.24 213.729 136.758 213.089 139.187 212.188L139.35 212.165L139.499 212.105C149.862 208.004 182.693 194.656 206.106 185.064C207.932 187.43 209.856 189.932 211.868 192.5C232.964 219.944 248.307 239.784 253.14 244.722C255.635 247.366 263.005 255.021 274.659 253.407C278.884 252.822 282.604 251.203 286.53 249.484L287.668 248.987L287.761 248.974C295.588 245.524 398.783 192.461 403.997 189.223L404.157 189.122C408.108 186.674 414.079 182.977 415.027 175.471C415.648 170.558 413.845 165.91 409.66 161.655L409.596 161.593L409.532 161.531C408.756 160.771 405.878 157.928 401.964 153.982C393.605 145.62 380.101 132.111 368.254 120.367C381.213 115.023 397.196 108.386 400.586 106.78C409.094 102.897 411.001 96.9068 411.389 93.6668C411.662 91.1445 411.597 84.8046 404.803 79.712ZM163.406 159.036C150.07 164.171 140.779 167.753 135.038 169.983C128.447 160.375 115.513 141.416 102.887 122.91C73.4511 79.7283 58.2586 57.501 50.2773 45.8846L56.5092 44.4695C66.7092 42.15 80.6792 38.9771 88.4582 37.2295C104.457 57.3025 159.399 126.229 180.373 152.506L163.406 159.036ZM308.417 191.512C290.539 200.298 280.855 205.086 275.622 207.679C269.639 200.353 256.429 183.9 244.688 169.224L331.063 134.012C335.662 138.746 344.452 147.711 361.771 165.195C348.435 171.806 326.188 182.758 308.417 191.512ZM338.618 91.4014L316.852 69.548C327.174 66.2336 333.117 64.3222 336.595 63.1859L347.476 73.4149L358.304 83.6038C352.172 86.0225 345.039 88.848 338.618 91.4014Z" fill="black" />
                                    </svg>

                                </li>
                                <li class="intro__logo">
                                    <svg width="319" height="349" viewBox="0 0 319 349" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M150.134 2.8577L280.395 58.3358C285.096 60.3919 289.187 63.6249 292.275 67.7229C295.362 71.8208 297.341 76.6454 298.02 81.731L317.97 225.79C318.696 230.876 318.103 236.063 316.248 240.854C314.392 245.645 311.336 249.878 307.374 253.148L197.081 341.868C193.251 344.94 188.68 346.952 183.828 347.702L183.379 347.764C178.39 348.45 173.309 347.772 168.675 345.802L125.1 326.702C122.408 325.6 119.319 323.914 119.171 320.962C119.022 318.009 121.819 316.51 123.009 315.88C130.313 312.013 132.365 310.428 139.98 304.366L140.221 304.174C141.102 303.556 142.13 303.183 143.202 303.091C144.274 302.999 145.351 303.193 146.324 303.653L178.842 317.335C179.052 317.377 179.27 317.347 179.461 317.25L287.411 230.81C287.51 230.699 287.582 230.568 287.624 230.426C287.666 230.284 287.675 230.134 287.652 229.988L267.989 87.9955C267.968 87.8296 267.908 87.6712 267.813 87.5333C267.719 87.3955 267.592 87.2823 267.445 87.2032L139.916 31.5203C139.822 31.4889 139.722 31.4795 139.624 31.4931C139.526 31.5067 139.433 31.5428 139.351 31.5986L31.8225 119.833C31.6989 119.942 31.6032 120.079 31.5436 120.233C31.4839 120.387 31.462 120.553 31.4796 120.717L51.1475 262.74C51.1655 262.88 51.2178 263.014 51.2997 263.129C51.3817 263.244 51.4909 263.338 51.6175 263.401L84.3615 277.407C92.3789 280.232 99.0918 279.902 103.271 276.484C104.801 275.165 105.964 273.473 106.648 271.573C107.331 269.672 107.511 267.627 107.171 265.636L87.8282 125.957C87.5723 124.215 88.0177 122.443 89.0668 121.029C90.1159 119.616 91.683 118.676 93.4242 118.416L110.742 116.018C112.488 115.794 114.252 116.273 115.646 117.349C117.039 118.424 117.95 120.009 118.177 121.755L137.52 261.433C141.109 287.348 127.885 305.583 103.015 309.027C95.95 310.005 89.8524 310.85 72.7992 304.907L72.6073 304.831L38.4589 290.365C33.7555 288.303 29.6625 285.065 26.5747 280.962C23.4869 276.858 21.5084 272.029 20.83 266.939L0.880229 122.88C0.149727 117.8 0.741716 112.617 2.599 107.833C4.45628 103.049 7.51607 98.8243 11.4828 95.5679L121.774 6.78507C125.753 3.72393 130.461 1.75195 135.434 1.0633C140.406 0.374646 145.473 0.99308 150.134 2.8577ZM166.476 200.878C170.105 213.64 177.373 220.851 206.228 216.856C235.068 212.862 236.919 201.683 235.783 193.654C235.069 188.5 234.261 182.666 195.017 184.023C161.421 185.159 138.221 179.878 134.138 150.396C130.415 123.506 149.463 104.504 185.104 99.5683C224.32 94.1375 246.364 105.304 252.162 132.537C252.544 134.332 252.202 136.204 251.211 137.748C250.715 138.516 250.06 139.17 249.291 139.665C248.522 140.161 247.656 140.486 246.751 140.621L231.376 142.75C229.901 142.933 228.408 142.607 227.143 141.825C225.879 141.044 224.92 139.854 224.424 138.453C219.28 125.908 208.484 124.887 188.961 127.591C161.522 131.391 162.895 141.303 163.481 145.536C164.295 151.417 164.667 154.102 203.353 154.123C241.409 154.153 261.469 159.482 265.493 188.538C267.497 203.016 263.392 215.966 253.738 225.812C244.084 235.659 229.002 242.243 210.137 244.855C149.162 253.299 140.1 217.023 138.538 205.741C138.269 204.018 138.695 202.259 139.72 200.849C140.746 199.439 142.288 198.492 144.01 198.216L159.331 196.095C160.898 195.903 162.481 196.281 163.792 197.159C165.103 198.037 166.056 199.357 166.476 200.878Z" fill="black" />
                                    </svg>

                                </li>
                                <li class="intro__logo">
                                    <svg width="252" height="288" viewBox="0 0 21 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_323_8)">
                                            <path d="M19.366 21.423L21.279 0H0L0.025 0.278L1.91 21.426L1.926 21.602L10.559 24H10.695L19.348 21.6L19.364 21.424L19.366 21.423ZM10.658 4.679H16.841L16.655 6.839L10.555 9.551L10.657 10.039H16.381L15.722 17.59L10.636 19L5.552 17.592L5.232 13.976H7.325L7.493 15.809L7.509 15.987L10.594 16.807H10.727L13.778 15.959L13.793 15.782L14.081 12.396L14.104 12.12H5.057L4.867 9.947L11.176 7.246L11.076 6.756H4.596L4.411 4.676H10.651L10.658 4.679Z" fill="black" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_323_8">
                                                <rect width="21" height="24" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg>


                                </li>
                            </ul>
                        </div>
                        <div class="intro__content">
                            <h2 class="intro__heading">Webサイト・Web App制作承ります</h2>
                            <p class="intro__description"><span>クライアント様の希望のデザインを忠実に表現できるよう、正確・丁寧なコーディングを心がけています。</span><span>また、「動きのあるページが欲しい」「こんな機能が欲しい」など、さまざまなリクエストに答えられるよう、日々のスキルアップ・情報の収集に努めています。</span>
                                もし、今のスキルで対応できないご要望でも何か解決策がないか模索します。相談は無料ですので、お気軽にお問い合わせください。</p>
                        </div>
                    </div>
                </div>
                <div id="main-content">
                    <main>
                        <section id="about" class="about">
                            <div class="about__heading">
                                <h2 class="card heading">ABOUT ME</h2>
                                <p>サイト制作はアフェリエイト時代を含めると5～6年の経験があります。本格的にWeb技術やプログラミングを勉強し始めてからも2～3年経ちます。</p>
                            </div>
                            <div class="separator">
                                <div class="separator__bar"></div>
                                <div class="separator__bar"></div>
                            </div>
                            <div class="about__card-container">
                                <div class="about__card">
                                    <div class="about__card-heading">
                                        <div>
                                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M32.48 23.02L35.62 19.88L28.12 12.38L24.98 15.52L16.7 7.25998C15.14 5.69998 12.6 5.69998 11.04 7.25998L7.24 11.06C5.68 12.62 5.68 15.16 7.24 16.72L15.5 24.98L6.3 34.2C6.1 34.4 6 34.64 6 34.92V41C6 41.56 6.44 42 7 42H13.08C13.34 42 13.6 41.9 13.78 41.7L23.02 32.46L31.28 40.72C33.92 43.36 36.8 40.86 36.94 40.72L40.74 36.92C42.3 35.36 42.3 32.82 40.74 31.26L32.48 23.02ZM18.36 22.14L10.08 13.88L13.86 10.08L16.4 12.62L15.46 13.6C15.086 13.9739 14.876 14.4811 14.876 15.01C14.876 15.5388 15.086 16.046 15.46 16.42C15.834 16.7939 16.3411 17.004 16.87 17.004C17.3989 17.004 17.906 16.7939 18.28 16.42L19.24 15.46L22.14 18.36L18.36 22.14ZM34.12 37.92L25.86 29.66L29.66 25.86L32.56 28.76L31.6 29.72C31.4148 29.9051 31.268 30.125 31.1677 30.3669C31.0675 30.6088 31.016 30.8681 31.016 31.13C31.016 31.3918 31.0675 31.6511 31.1677 31.8931C31.268 32.135 31.4148 32.3548 31.6 32.54C31.7852 32.7251 32.005 32.872 32.2469 32.9722C32.4888 33.0724 32.7481 33.124 33.01 33.124C33.2719 33.124 33.5312 33.0724 33.7731 32.9722C34.015 32.872 34.2348 32.7251 34.42 32.54L35.38 31.58L37.92 34.12L34.12 37.92ZM41.42 14.08C41.6054 13.895 41.7525 13.6752 41.8529 13.4332C41.9532 13.1913 42.0049 12.9319 42.0049 12.67C42.0049 12.408 41.9532 12.1487 41.8529 11.9067C41.7525 11.6648 41.6054 11.445 41.42 11.26L36.74 6.57998C35.8 5.63998 34.5 5.99998 33.92 6.57998L30.26 10.24L37.76 17.74L41.42 14.08Z" fill="#F6F6F6" />
                                            </svg>

                                        </div>
                                        <h3>Design</h3>
                                    </div>
                                    <div class="about__card-content">
                                        <p>クライアント様のご要望やご提案をもとに、サイトをデザインします。また、ゼロからサイトをデザインし、制作中に相談することも可能です。</p>
                                    </div>
                                </div>
                                <div class="about__card">
                                    <div class="about__card-heading">
                                        <div>
                                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M40 6H8C5.794 6 4 7.794 4 10V38C4 40.206 5.794 42 8 42H40C42.206 42 44 40.206 44 38V10C44 7.794 42.206 6 40 6ZM8 38V14H40L40.004 38H8Z" fill="#F6F6F6" />
                                                <path d="M18.586 18.5859L11.172 25.9999L18.586 33.4139L21.414 30.5859L16.828 25.9999L21.414 21.4139L18.586 18.5859ZM29.414 18.5859L26.586 21.4139L31.172 25.9999L26.586 30.5859L29.414 33.4139L36.828 25.9999L29.414 18.5859Z" fill="#F6F6F6" />
                                            </svg>

                                        </div>
                                        <h3>Coding</h3>
                                    </div>
                                    <div class="about__card-content">
                                        <p>デザインに忠実にコーディングします。動きのあるサイトのご要望があれば、JavaScriptで実装可能です。好みのアニメーションをご指定ください。　</p>
                                    </div>
                                </div>
                                <div class="about__card">
                                    <div class="about__card-heading">
                                        <div>
                                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M37.899 22.9589C37.899 20.4149 36.984 18.6539 36.201 17.2829L35.961 16.8929C35.01 15.3629 34.179 14.0189 34.179 12.4529C34.179 10.5629 35.613 8.7989 37.635 8.7989C37.695 8.7989 37.752 8.8049 37.809 8.8079L37.902 8.8169C34.1105 5.33432 29.1482 3.40465 24 3.4109C20.588 3.40915 17.2292 4.25637 14.2262 5.87621C11.2233 7.49606 8.67052 9.83762 6.79803 12.6899C7.27803 12.7049 7.73703 12.7169 8.12403 12.7169C10.275 12.7169 13.608 12.4559 13.608 12.4559C14.718 12.3899 14.85 14.0189 13.74 14.1509C13.74 14.1509 12.627 14.2829 11.385 14.3459L18.885 36.6479L23.385 23.1299L20.175 14.3429C19.068 14.2769 18.018 14.1479 18.018 14.1479C16.908 14.0819 17.04 12.3839 18.147 12.4499C18.147 12.4499 21.549 12.7109 23.571 12.7109C25.725 12.7109 29.061 12.4499 29.061 12.4499C30.171 12.3839 30.3 14.0159 29.19 14.1479C29.19 14.1479 28.074 14.2769 26.835 14.3429L34.275 36.4739L36.327 29.6129L36.489 29.0939C37.299 26.5139 37.896 24.6089 37.896 22.9559L37.899 22.9589ZM3.41103 23.9999C3.41082 27.8661 4.49906 31.6543 6.55121 34.931C8.60337 38.2076 11.5365 40.8404 15.015 42.5279L5.19003 15.6179C4.01352 18.2555 3.40729 21.1118 3.41103 23.9999Z" fill="#F6F6F6" />
                                                <path d="M18.183 43.7491L24.363 25.8001L30.69 43.1401C30.732 43.2391 30.78 43.3321 30.837 43.4221C26.7583 44.859 22.3304 44.9734 18.183 43.7491ZM42.063 14.1211C42.153 14.7781 42.204 15.4801 42.204 16.2391C42.204 18.3271 41.814 20.6761 40.638 23.6131L34.35 41.7931C38.9901 39.0972 42.3936 34.6954 43.835 29.5261C45.2764 24.3569 44.6416 18.8291 42.066 14.1211H42.063Z" fill="#F6F6F6" />
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0 24C0 10.767 10.767 0 24 0C37.23 0 48 10.767 48 24C48 37.233 37.23 48 24 48C10.767 48 0 37.233 0 24ZM1.101 24C1.101 36.627 11.373 46.899 24 46.899C36.624 46.899 46.896 36.627 46.896 24C46.896 11.37 36.624 1.101 24 1.101C11.37 1.101 1.101 11.37 1.101 24Z" fill="#F6F6F6" />
                                            </svg>

                                        </div>
                                        <h3>Wordpress</h3>
                                    </div>
                                    <div class="about__card-content">
                                        <p>ブログやお知らせなど、ご自身でコンテンツを発信をお望みでしたら、作成したサイトのWordpress化にも対応しています。既存テーマのカスタマイズでの安価なプランも選べます。　</p>
                                    </div>
                                </div>
                                <div class="about__card">
                                    <div class="about__card-heading">
                                        <div>
                                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M6.4 11.4272L5.8944 9.9104C5.51169 10.0379 5.19124 10.3052 4.99721 10.6588C4.80318 11.0125 4.74989 11.4263 4.848 11.8176L6.4 11.424V11.4272ZM13.9424 8.9152L15.3728 8.1984C15.2002 7.85458 14.9095 7.58446 14.5539 7.43753C14.1984 7.29061 13.8018 7.27671 13.4368 7.3984L13.9424 8.9152ZM29.0272 39.0848L27.5968 39.8016C27.6954 39.999 27.8338 40.1738 28.0032 40.3152C28.1727 40.4565 28.3695 40.5613 28.5814 40.6229C28.7932 40.6845 29.0156 40.7016 29.2344 40.6732C29.4532 40.6447 29.6637 40.5713 29.8528 40.4576L29.0272 39.0848ZM41.6 31.5424L42.4224 32.9152C42.6056 32.8054 42.765 32.66 42.8912 32.4876C43.0173 32.3152 43.1077 32.1193 43.1569 31.9114C43.2061 31.7035 43.2132 31.4879 43.1777 31.2772C43.1422 31.0665 43.065 30.8651 42.9504 30.6848L41.6 31.5424ZM32.8 17.7152L32.4128 16.1632C32.1672 16.225 31.9399 16.3442 31.7494 16.511C31.5588 16.6778 31.4106 16.8874 31.3169 17.1226C31.2232 17.3579 31.1867 17.612 31.2103 17.8641C31.2339 18.1162 31.317 18.3591 31.4528 18.5728L32.8 17.7152ZM37.8272 16.4576L39.1072 15.4976C38.9186 15.2465 38.6602 15.0565 38.3643 14.9512C38.0684 14.8459 37.7481 14.8301 37.4432 14.9056L37.8272 16.4576ZM41.6 21.4848L42.1056 23.0048C42.3465 22.9248 42.5649 22.7886 42.7427 22.6075C42.9206 22.4264 43.0528 22.2056 43.1285 21.9633C43.2041 21.721 43.2211 21.4642 43.1778 21.2141C43.1346 20.9639 43.0326 20.7277 42.88 20.5248L41.6 21.4848ZM11.4272 31.5424L9.8752 31.9296C9.92829 32.144 10.0252 32.3452 10.1599 32.5203C10.2945 32.6954 10.464 32.8408 10.6576 32.9472C10.8512 33.0536 11.0647 33.1188 11.2847 33.1386C11.5048 33.1585 11.7265 33.1325 11.936 33.0624L11.4272 31.5424ZM6.9056 12.9472L14.448 10.432L13.4368 7.3952L5.8944 9.9104L6.9056 12.9472ZM12.512 9.6288L21.8496 28.3072L24.7136 26.8768L15.3728 8.1984L12.512 9.6288ZM21.8496 28.3072L27.5968 39.8016L30.4608 38.3712L24.7136 26.8768L21.8496 28.3072ZM29.8496 40.4576L42.4256 32.9152L40.7776 30.1696L28.2048 37.7152L29.8528 40.4576H29.8496ZM42.9504 30.6848L37.6704 22.3872L34.9696 24.1056L40.2496 32.4032L42.9504 30.6848ZM37.6704 22.3872L34.1504 16.8544L31.4496 18.5728L34.9696 24.1056L37.6704 22.3872ZM33.1904 19.2672L38.2144 18.0096L37.44 14.9056L32.4128 16.1632L33.1872 19.2672H33.1904ZM36.5504 17.4176L40.32 22.4448L42.88 20.5248L39.1072 15.4976L36.5472 17.4176H36.5504ZM41.0944 19.968L35.8144 21.728L36.8256 24.7648L42.1056 23.0048L41.0944 19.968ZM35.8144 21.728L22.7744 26.0736L23.7888 29.1104L36.8256 24.7648L35.8144 21.728ZM22.7744 26.0736L10.9216 30.0256L11.936 33.0624L23.7888 29.1104L22.7744 26.0736ZM12.9824 31.1552L7.9488 11.04L4.8448 11.8176L9.872 31.9296L12.976 31.1552H12.9824ZM8 3.2H40V0H8V3.2ZM44.8 8V40H48V8H44.8ZM40 44.8H8V48H40V44.8ZM3.2 40V8H0V40H3.2ZM8 44.8C6.72696 44.8 5.50606 44.2943 4.60589 43.3941C3.70571 42.4939 3.2 41.273 3.2 40H0C0 42.1217 0.842855 44.1566 2.34315 45.6569C3.84344 47.1571 5.87827 48 8 48V44.8ZM44.8 40C44.8 41.273 44.2943 42.4939 43.3941 43.3941C42.4939 44.2943 41.273 44.8 40 44.8V48C42.1217 48 44.1566 47.1571 45.6569 45.6569C47.1571 44.1566 48 42.1217 48 40H44.8ZM40 3.2C41.273 3.2 42.4939 3.70571 43.3941 4.60589C44.2943 5.50606 44.8 6.72696 44.8 8H48C48 5.87827 47.1571 3.84344 45.6569 2.34315C44.1566 0.842855 42.1217 0 40 0V3.2ZM8 0C5.87827 0 3.84344 0.842855 2.34315 2.34315C0.842855 3.84344 0 5.87827 0 8H3.2C3.2 6.72696 3.70571 5.50606 4.60589 4.60589C5.50606 3.70571 6.72696 3.2 8 3.2V0Z" fill="#F6F6F6" />
                                            </svg>

                                        </div>
                                        <h3>Laravel</h3>
                                    </div>
                                    <div class="about__card-content">
                                        <p>Larvel8を使用した会員制サイトやWebアプリの制作も準備中です。簡単な処理のみであれば、現在も受注可能です。</p>
                                    </div>
                                </div>
                            </div>
                            <div class="separator">
                                <div class="separator__bar"></div>
                                <div class="separator__bar"></div>
                            </div>
                        </section>
                        <section id="skills" class="skills">
                            <div class="skills__heading">
                                <h2 class="card heading">SKILLS</h2>
                            </div>
                            <div class="skills__title">
                                <h3>USING NOW</h3>
                            </div>
                            <div class="skills__card-container">
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/HTML_LS.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">HTML LS</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/CSS3.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">CSS3</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/JavaScript.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">JAVASCRIPT</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/php.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">PHP</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/figma.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">FIGMA</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/sass.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">SASS</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/GitHub.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">GIT/GITHUB</h4>
                                </div>
                                <div class="card skills__card">
                                    <div class="skills__card-image">
                                        <img src="images/SQL.svg" alt="">
                                    </div>
                                    <h4 class="skills__language">SQL</h4>
                                </div>
                            </div>
                            <div class="learning-area">
                                <div class="skills__title">
                                    <h3>LEARNING</h3>
                                </div>
                                <div class="skills__card-container">
                                    <div class="card skills__card">
                                        <div class="skills__card-image">
                                            <img src="images/HTML_LS.svg" alt="">
                                        </div>
                                        <h4 class="skills__language">HTML LS</h4>
                                    </div>
                                    <div class="card skills__card">
                                        <div class="skills__card-image">
                                            <img src="images/CSS3.svg" alt="">
                                        </div>
                                        <h4 class="skills__language">CSS3</h4>
                                    </div>
                                    <div class="card skills__card">
                                        <div class="skills__card-image">
                                            <img src="images/JavaScript.svg" alt="">
                                        </div>
                                        <h4 class="skills__language">JAVASCRIPT</h4>
                                    </div>
                                    <div class="card skills__card">
                                        <div class="skills__card-image">
                                            <img src="images/php.svg" alt="">
                                        </div>
                                        <h4 class="skills__language">PHP</h4>
                                    </div>
                                </div>
                            </div>
                        </section>
                        <section id="portfolio" class="portfolio">
                            <div class="portfolio__image">
                                <img width="1920" height="1280" src="images/ken-cheung-KonWFWUaAuk-unsplash.jpg" alt="">
                            </div>
                            <div class="portfolio__heading">
                                <h2 class="heading card">PORTFOLIO</h2>
                            </div>
                            <div class="portfolio__works-container">
                                <div class="portfolio__work" data-work="work-1">
                                    <div class="work-image">
                                        <img src="images/dezon.png" alt="">
                                        <h3>My Homepage</h3>
                                    </div>
                                </div>
                                <div class="portfolio__work" data-work="work-2">
                                    <div class="work-image">
                                        <img src="images/old_site.png" alt="">
                                        <h3>旧サイト</h3>
                                    </div>
                                </div>
                                <div class="portfolio__work" data-work="work-3">
                                    <div class="work-image">
                                        <img src="images/burinyan.png" alt="">
                                        <h3>Brinyanの羊毛フェルト</h3>
                                    </div>
                                </div>
                                <div class="portfolio__work" data-work="work-4">
                                    <div class="work-image">
                                        <img src="images/furniture.png" alt="">
                                        <h3>家具店(サンプルサイト)</h3>
                                    </div>
                                </div>
                                <div class="portfolio__work" data-work="work-5">
                                    <div class="work-image">
                                        <img src="images/chinese.png" alt="">
                                        <h3>中華料理店(サンプルサイト)</h3>
                                    </div>
                                </div>
                                <div class="portfolio__work" data-work="work-6">
                                    <div class="work-image">
                                        <img src="images/factory.png" alt="">
                                        <h3>サンプル製作所</h3>
                                    </div>
                                </div>
                            </div>
                        </section>
                        <section id="contact" class="form">
                            <div class="form__heading">
                                <h2 class="card heading">CONTACT</h2>
                                <p>お仕事の依頼はコンタクトフォームよりお願いします。一両日中にお返事させていただきます。ご質問等、お気軽にお問い合わせください。</p>
                            </div>
                            <div class="separator">
                                <div class="separator__bar"></div>
                                <div class="separator__bar"></div>
                            </div>
                            <div class="form__wrapper card">
                                <form action="php/confirm.php" class="form__form validate-form" method="POST" novalidate>
                                    <div class="form__member">
                                        <div class="form__icon">
                                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M25.4815 24.4618C25.2369 24.3818 23.6907 23.6849 24.6569 20.7479H24.643C27.1615 18.1541 29.0861 13.9802 29.0861 9.871C29.0861 3.55254 24.8846 0.240234 20.0015 0.240234C15.1154 0.240234 10.9369 3.551 10.9369 9.871C10.9369 13.9972 12.8507 18.1879 15.3846 20.7756C16.3723 23.3664 14.6061 24.3279 14.2369 24.4633C9.12305 26.3125 3.12305 29.6833 3.12305 33.011V34.2587C3.12305 38.7925 11.9138 39.8233 20.0492 39.8233C28.1969 39.8233 36.8769 38.7925 36.8769 34.2587V33.011C36.8769 29.5833 30.8477 26.2387 25.4815 24.4618Z" fill="#F6F6F6" />
                                            </svg>
                                        </div>
                                        <input type="text" class="form__input validate-target" required data-maxlength="30" name="name" placeholder="NAME" value="<?php echo h($name) ?>">
                                        <span class="error-php invalid-feedback"><?php echo h($error_name) ?></span>
                                    </div>
                                    <div class="form__member">
                                        <div class="form__icon">
                                            <svg width="40" height="40" viewBox="0 0 36 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M32.33 5.99979C32.1937 5.98575 32.0563 5.98575 31.92 5.99979H3.92001C3.74056 6.00256 3.56229 6.02947 3.39001 6.07979L17.84 20.4698L32.33 5.99979Z" fill="#F6F6F6" />
                                                <path d="M33.8101 7.39014L19.2501 21.8901C18.8753 22.2626 18.3684 22.4717 17.8401 22.4717C17.3117 22.4717 16.8048 22.2626 16.4301 21.8901L2.00005 7.50014C1.95569 7.66318 1.93217 7.83118 1.93005 8.00014V28.0001C1.93005 28.5306 2.14077 29.0393 2.51584 29.4144C2.89091 29.7894 3.39962 30.0001 3.93005 30.0001H31.9301C32.4605 30.0001 32.9692 29.7894 33.3443 29.4144C33.7193 29.0393 33.9301 28.5306 33.9301 28.0001V8.00014C33.9221 7.79179 33.8816 7.58597 33.8101 7.39014ZM5.30005 28.0001H3.91005V26.5701L11.1801 19.3601L12.5901 20.7701L5.30005 28.0001ZM31.9101 28.0001H30.5101L23.2201 20.7701L24.6301 19.3601L31.9001 26.5701L31.9101 28.0001Z" fill="#F6F6F6" />
                                            </svg>

                                        </div>
                                        <input type="email" class="form__input validate-target" required pattern="^[a-zA-Z0-9_+-]+(.[a-zA-Z0-9_+-]+)*@([a-zA-Z0-9][a-zA-Z0-9-]*[a-zA-Z0-9]*\.)+[a-zA-Z]{2,}$" name="email" placeholder="EMAIL" value="<?php echo h($email); ?>">
                                        <span class="error-php invalid-feedback"><?php echo h($error_email); ?></span>
                                    </div>
                                    <div class="form__message">
                                        <label for="message" class="form__textarea-heading">
                                            <div class="form__icon">
                                                <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path d="M34.8795 5.49088C35.0897 5.70176 35.2077 5.98738 35.2077 6.28513C35.2077 6.58289 35.0897 6.86851 34.8795 7.07938L32.5327 9.42838L28.0327 4.92838L30.3795 2.57938C30.5904 2.36848 30.8765 2.25 31.1748 2.25C31.4732 2.25 31.7593 2.36848 31.9702 2.57938L34.8795 5.48863V5.49088ZM30.942 11.0169L26.442 6.51688L11.1127 21.8484C10.9889 21.9722 10.8957 22.1232 10.8405 22.2894L9.02922 27.7209C8.99637 27.8199 8.99171 27.9261 9.01575 28.0276C9.03979 28.1291 9.09159 28.222 9.16536 28.2957C9.23913 28.3695 9.33196 28.4213 9.43348 28.4454C9.535 28.4694 9.6412 28.4647 9.74022 28.4319L15.1717 26.6206C15.3377 26.5661 15.4887 26.4737 15.6127 26.3506L30.942 11.0191V11.0169Z" fill="#F6F6F6" />
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M2.25 31.501C2.25 32.3961 2.60558 33.2545 3.23851 33.8875C3.87145 34.5204 4.72989 34.876 5.625 34.876H30.375C31.2701 34.876 32.1286 34.5204 32.7615 33.8875C33.3944 33.2545 33.75 32.3961 33.75 31.501V18.001C33.75 17.7026 33.6315 17.4165 33.4205 17.2055C33.2095 16.9945 32.9234 16.876 32.625 16.876C32.3266 16.876 32.0405 16.9945 31.8295 17.2055C31.6185 17.4165 31.5 17.7026 31.5 18.001V31.501C31.5 31.7993 31.3815 32.0855 31.1705 32.2965C30.9595 32.5075 30.6734 32.626 30.375 32.626H5.625C5.32663 32.626 5.04048 32.5075 4.82951 32.2965C4.61853 32.0855 4.5 31.7993 4.5 31.501V6.75098C4.5 6.45261 4.61853 6.16646 4.82951 5.95548C5.04048 5.7445 5.32663 5.62598 5.625 5.62598H20.25C20.5484 5.62598 20.8345 5.50745 21.0455 5.29647C21.2565 5.08549 21.375 4.79935 21.375 4.50098C21.375 4.20261 21.2565 3.91646 21.0455 3.70548C20.8345 3.4945 20.5484 3.37598 20.25 3.37598H5.625C4.72989 3.37598 3.87145 3.73156 3.23851 4.36449C2.60558 4.99743 2.25 5.85587 2.25 6.75098V31.501Z" fill="#F6F6F6" />
                                                </svg>
                                            </div>
                                            <div class="form__textarea-title">MESSAGE</div>
                                        </label>
                                        <textarea id="message" class="form__textarea validate-target" required maxlength="1000" name="message" id="" cols="30" rows="10"><?php echo h($message) ?></textarea>
                                        <span class="error-php invalid-feedback"><?php echo h($error_message); ?></span>
                                    </div>
                                    <input type="hidden" name="ticket" value="<?php echo h($ticket); ?>">
                                    <div class="form__button">
                                        <input type="submit" class="submit-btn" value="送信">
                                    </div>
                                </form>
                            </div>
                        </section>
                    </main>
                </div>
            </div>
            <footer class="footer">
                <div class="footer__inner">
                    <div class="footer__back backToTop">
                        <div class="back-arrow">
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M3.125 5.3125V8.125L7.5 5L11.875 8.125V5.3125L7.5 2.1875L3.125 5.3125Z" fill="white" />
                                <path d="M3.125 9.6875V12.5L7.5 9.375L11.875 12.5V9.6875L7.5 6.5625L3.125 9.6875Z" fill="white" />
                            </svg>

                        </div>
                        <div class="back-text">BACK TO TOP</div>
                    </div>
                    <div class="footer__link">
                        <a href="#">
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.5 10.4205C21.948 10.6605 21.3555 10.8255 20.733 10.8975C21.369 10.5225 21.855 9.92852 22.086 9.22202C21.4799 9.57521 20.8187 9.8237 20.13 9.95701C19.8403 9.65337 19.4918 9.41193 19.1058 9.24739C18.7197 9.08286 18.3042 8.99869 17.8845 9.00002C16.185 9.00002 14.808 10.3575 14.808 12.03C14.808 12.267 14.835 12.498 14.8875 12.72C13.6685 12.6621 12.4749 12.3508 11.383 11.8058C10.291 11.2609 9.32464 10.4943 8.5455 9.55502C8.27184 10.0157 8.12777 10.5417 8.1285 11.0775C8.1285 12.1275 8.673 13.0575 9.498 13.599C9.00967 13.5837 8.53179 13.4537 8.103 13.2195V13.257C8.10763 13.9612 8.3562 14.642 8.80638 15.1835C9.25655 15.7251 9.88051 16.0938 10.572 16.227C10.118 16.3471 9.64304 16.3645 9.1815 16.278C9.38269 16.8838 9.76751 17.4119 10.2825 17.7891C10.7976 18.1662 11.4172 18.3736 12.0555 18.3825C10.9604 19.2264 9.61596 19.6823 8.2335 19.6785C7.986 19.6785 7.7415 19.6635 7.5 19.6365C8.91071 20.5294 10.5464 21.0024 12.216 21C17.877 21 20.9715 16.383 20.9715 12.378L20.961 11.985C21.5644 11.5609 22.0859 11.0308 22.5 10.4205Z" fill="white" />
                                <path d="M6 3C5.20435 3 4.44129 3.31607 3.87868 3.87868C3.31607 4.44129 3 5.20435 3 6V24C3 24.7956 3.31607 25.5587 3.87868 26.1213C4.44129 26.6839 5.20435 27 6 27H24C24.7956 27 25.5587 26.6839 26.1213 26.1213C26.6839 25.5587 27 24.7956 27 24V6C27 5.20435 26.6839 4.44129 26.1213 3.87868C25.5587 3.31607 24.7956 3 24 3H6ZM6 0H24C25.5913 0 27.1174 0.632141 28.2426 1.75736C29.3679 2.88258 30 4.4087 30 6V24C30 25.5913 29.3679 27.1174 28.2426 28.2426C27.1174 29.3679 25.5913 30 24 30H6C4.4087 30 2.88258 29.3679 1.75736 28.2426C0.632141 27.1174 0 25.5913 0 24V6C0 4.4087 0.632141 2.88258 1.75736 1.75736C2.88258 0.632141 4.4087 0 6 0Z" fill="white" />
                            </svg>

                        </a>
                        <a href="#">
                            <svg width="30" height="28" viewBox="0 0 30 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.4805 0H2.51953C1.81641 0 1.2207 0.354776 0.732422 1.06433C0.244141 1.77388 0 2.59259 0 3.52047V24.4795C0 25.4074 0.244141 26.2261 0.732422 26.9357C1.2207 27.6452 1.81641 28 2.51953 28H27.4805C28.1836 28 28.7793 27.6452 29.2676 26.9357C29.7559 26.2261 30 25.4074 30 24.4795V3.52047C30 2.59259 29.7559 1.77388 29.2676 1.06433C28.7793 0.354776 28.1836 0 27.4805 0ZM25.1367 3.52047L15 11.8713L4.86328 3.52047H25.1367ZM2.51953 24.4795V5.64912L14.3555 15.5556C14.4336 15.6647 14.6484 15.7193 15 15.7193C15.3516 15.7193 15.5664 15.6647 15.6445 15.5556L27.4805 5.64912V24.4795H2.51953Z" fill="white" />
                            </svg>

                        </a>
                    </div>
                    <span class="copy-right">&copy;2022 Ururunya All Rights Reserved.</span>
                </div>
            </footer>
            <div class="modal work-1">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img width="145" height="1600" src="images/de-zon.net_.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">Dezon（私のサイトです）</h3>
                        <p class="modal__description">現在稼働中のホームページです。WordpressのyStandardというテーマをフルカスタマイズしています。GSAPを使ってinview時のアニメーション発火や横スクロールを実装し、アニメーション自体はyStandardの機能やVanillaJSで実装しています。</p>
                        <div class="modal__link">
                            <a href="https://de-zon.net/">https://de-zon.net/</a>
                        </div>
                    </div>
                </div>
            </div>
            <div class="modal work-2">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img width="199" height="1000" src="images/old.de-zon.net_.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">旧サイト</h3>
                        <p class="modal__description">以前、運用していた自サイトです。ゼロからHTML,CSSを書き、Wordpress化しています。初期のもので、垢抜けない作品ですが、初めてフルオリジナルで作ったサイトなので記念に残しています。</p>
                        <div class="modal__link">
                            <a href="https://old.de-zon.net/">https://old.de-zon.net/</a>
                        </div>
                    </div>
                </div>
            </div>
            <div class="modal work-3">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img src="images/brinyan.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">Brinyanの羊毛フェルト</h3>
                        <p class="modal__description">トップページと作品紹介ページをオリジナルで書き、ベースのWordpressテーマyStandardに組み込んでいます。トップページはスクロールすると画像とテキスト情報のみが切り替わるよう、オリジナルのJavaScriptで実装しています。</p>
                        <div class="modal__link">
                            <a href="https://brinyan.always-happy.net/">https://brinyan.always-happy.net/</a>
                        </div>
                    </div>
                </div>
            </div>
            <div class="modal work-4">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img width="221" height="1280" src="images/furniture.de-zon.net_.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">家具店（架空サイト）</h3>
                        <p class="modal__description">WordpressテーマDiviをカスタマイズした架空サイトです。工程数が少ないので納期は早く、価格も抑えられます。</p>
                        <div class="modal__link">
                            <a href="https://furniture.de-zon.net/">https://furniture.de-zon.net/</a>
                        </div>
                    </div>
                </div>
            </div>
            <div class="modal work-5">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img width="220" height="1280" src="images/chinese.de-zon.net_.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">中華料理店（架空サイト）</h3>
                        <p class="modal__description">こちらもWordpressテーマのDiviをカスタマイズしたサンプルサイトです。工程数が少ないので納期は早く、価格も抑えられます。</p>
                        <div class="modal__link">
                            <a href="https://chinese.de-zon.net/">https://chinese.de-zon.net/</a>
                        </div>
                    </div>
                </div>
            </div>
            <div class="modal work-6">
                <div class="modal__inner">
                    <div class="modal__image">
                        <img width="301" height="1000" src="images/sample-factory.de-zon.net_.png" alt="">
                    </div>
                    <div class="modal__content">
                        <h3 class="modal__title">金属部品製作所（架空サイト）</h3>
                        <p class="modal__description">WordpressテーマのLightningをカスタマイズしたサンプルサイトです。工程数が少ないので納期は早く、価格も抑えられます。</p>
                        <div class="modal__link">
                            <a href="https://sample-factory.de-zon.net/">https://sample-factory.de-zon.net/</a>
                        </div>
                    </div>
                </div>
            </div>

        </div>
        <nav class="mobile-menu">
            <ul class="mobile-menu__main">
                <li class="mobile-menu__item">
                    <a class="mobile-menu__link" href="#" data-target="container">
                        <span class="main-title">Top</span>
                    </a>
                </li>
                <li class="mobile-menu__item">
                    <a class="mobile-menu__link" href="#about" data-target="about">
                        <span class="main-title">About</span>
                    </a>
                </li>
                <li class="mobile-menu__item">
                    <a class="mobile-menu__link" href="#skills" data-target="skills">
                        <span class="main-title">Skills</span>
                    </a>
                </li>
                <li class="mobile-menu__item">
                    <a class="mobile-menu__link" href="#portfolio" data-target="portfolio">
                        <span class="main-title">Portfolio</span>
                    </a>
                </li>
                <li class="mobile-menu__item">
                    <a class="mobile-menu__link" href="#contact" data-target="contact">
                        <span class="main-title">Contact</span>
                    </a>
                </li>
            </ul>
        </nav>
    </div>
    <script src="scripts/libs/header-menu.js"></script>
    <script src="scripts/libs/mobile-menu.js"></script>
    <script src="scripts/libs/modal.js"></script>
    <script src="scripts/libs/scroll.js"></script>
    <script src="scripts/libs/form-validate.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/simple-parallax-js@5.6.1/dist/simpleParallax.min.js"></script>
    <script src="scripts/main.js"></script>
    <script>
        const image = document.querySelector('.portfolio__image img');
        new simpleParallax(image, {
            scale: 1.5,
            customWrapper: '.portfolio__image',
            delay: .6,
            transition: 'cubic-bezier(0,0,0,1)'
        });
    </script>
</body>

</html>
